In [3]:
import pandas as pd
import numpy as np

# Creating A dataframe from an array

## 1. Option 1

In [4]:
# creating an Array
data = np.array([[1,4],[2,5],[3,6]])
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [5]:
#creating a dataframe
df = pd.DataFrame(data,index=['row1','row2','row3'],
            columns=['col1','col2'])

In [6]:
# showing dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## 2. option 2

In [7]:
#creating an array with list shape
data= [[1,4],[2,5],[3,6]]

In [8]:
#creating a dataframe 
df = pd.DataFrame(data,index=['row1','row2','row3'],
            columns=['col1','col2'])

In [9]:
# showing the dataframe 
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Option 3 Creating a DataFrame From a dictionary

In [10]:
# lists used for this example
states=['california' , ' Texas' , 'Florida ' , 'new york' ]
population = [112113321,23123121,12412421,124222211]

In [11]:
# storing list within a dictionary
dict_states={'States':states,'Population':population}

In [12]:
# Creating the dataframe
df=pd.DataFrame(dict_states)

In [13]:
# showing the data frame
df

       States  Population
0  california   112113321
1       Texas    23123121
2    Florida     12412421
3    new york   124222211

## Option 4 : Creating a DF from a CSV File

In [14]:
# reading the csv file
df_salary=pd.read_csv("Salary.csv")

In [15]:
# show first 5 row in a dataFrame
df_salary.head()

,name,JobTitle,AgencyID,Agency,HireDate,AnnualSalary,GrossPay
0,"Aaron,Patricia G",Facilities/Office Services II,A03031,OED-Employment Dev (031),10/24/1979,$55314.00,$53626.04
1,"Aaron,Petra L",ASSISTANT STATE'S ATTORNEY,A29045,States Attorneys Office (045),09/25/2006,$74000.00,$73000.08
2,"Abaineh,Yohannes T",EPIDEMIOLOGIST,A65026,HLTH-Health Department (026),07/23/2009,$64500.00,$64403.84
3,"Abbene,Anthony M",POLICE OFFICER,A99005,Police Department (005),07/24/2013,$46309.00,$59620.16
4,"Abbey,Emmanuel",CONTRACT SERV SPEC II,A40001,M-R Info Technology (001),05/01/2013,$60060.00,$54059.60